Repository: ESUCC/Maximd
Catalog: application/translation/form001/page1.tmx
Source language: es
Languages: en

source: Notificación y consentimiento para una evaluación inicial
en: Notice and Consent for Initial Evaluation

source: Explicación del porqué el distrito propone evaluar a su niño/a
en: Explanation of why the district proposes to evaluate your child

source: Fecha de la notificación
en: Date of Notice

source: Opciones consideradas por el distrito
en: Any options the district considered

source: Motivos por los que las opciones que aparecen anteriormente fueron rechazadas
en: Reasons why the above options were rejected

source: Esta propuesta se basa en los exámenes, registros, reportes o procesos de la evalución descritos a continuación
en: This proposal is based on the evaluation procedures, tests, records, or reports described below

source: Otros factores relacionados a esta propuesta
en: Any other factors relevant to this proposal

source: Se estima que el tiempo requerido para completar la evaluación multidisciplinaria y para tomar la decisión de verificación es
en: The estimated amount of time for completing the multidisciplinary evaluation and making the verification decision is

source: No debe exceder más de 45 días escolares
en: Not to exceed 45 school days

source: propone llevar a cabo una evaluación multidisciplinaria de su hijo/a. El distrito propone evaluar a su hijo/a porque
en: proposes to conduct a multidisciplinary evaluation of your child. The district proposes to evaluate your child because
